# GetValidTypes Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Subelement..::..GetValidTypes Method
Subelement Class See Also
---
Obtains a set of types that are valid for this subelement.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public ISet<ElementId> GetValidTypes()
```

Visual Basic
---
```text
Public Function GetValidTypes As ISet(Of ElementId)
```

Visual C++
---
```text
public:
ISet<ElementId^>^ GetValidTypes()
```

# ### Return Value
A set of element IDs of types that are valid for this subelement or an empty set if subelement cannot have type assigned.
# Remarks
A type is valid for a subelement if it can be assigned to the subelement.
# See Also
Subelement Class
Autodesk.Revit.DB Namespace